# Задача 2: Найдите сумму цифр трехзначного числа.


number = input("Введите трехзначное число: ")
num1 = int(number[0])
num2 = int(number[1])
num3 = int(number[2])
print("Сумма цифр =", num1 + num2 + num3)

